/*
 Localizable.strings
 Owncloud iOs Client
 
 Created by Javier Gonzalez on 7/17/12.
 */

/*
 Copyright (C) 2016, ownCloud GmbH.
 This code is covered by the GNU Public License Version 3.
 For distribution utilizing Apple mechanisms please see https://owncloud.org/contribute/iOS-license-exception/
 You should have received a copy of this license
 along with this program. If not, see <http://www.gnu.org/licenses/gpl-3.0.en.html>.
 */


//First Screen
"go_to_login" = "Skapa konto";
"you_need_an_account" = "Det finns inget $appname konto på din enhet.\nFör att använda denna App, måste du skapa ett.";

//Login Screen
"testing_connection" = "Testar anslutning";
"server_instance_not_found" = "Servern hittades inte";
"secure_connection_established" = "Secure Connection";
"https_non_secure_connection_established" = "Omdirigerad till en osäker rutt";
"connection_established" = "Non-secure Connection";
"login_details" = "Inloggningsuppgifter";
"username" = "Användarnamn";
"password" = "Lösenord";
"login" = "Anslut";
"cancel" = "Avbryt";
"error_login_message" = "Felaktigt användarnamn eller lösenord";
"error_updating_predefined_url" = "Server moved to a different URL. Please, authenticate again to update your account";
"ok" = "OK";
"url_sample" = "Serveradress https://...";
"forbidden_characters_in_password" = "This password contains forbidden characters";
"server" = "Server";
"url" = "URL";
"session_expired" = "Din session har upphört att gälla. Vänligen anslut igen";
"credentials_different_user" = "Den angivna användaren matchar inte användaren för detta konto";
"auth_unsupported_auth_method" = "Servern har inte stöd för denna autentiseringsmetod";
"server_does_not_give_user_id" = "Servern returnerar inte ett korrekt användar-ID. Kontakta administratören";
"authentification_not_valid" = "Det går inte att autentisera mot denna server";
"error_too_many_http_redirects" = "Ett fel uppstod när anslutningen skulle etableras. Var god försök igen.";
"retry" = "Försök igen";
"help_link_login" = "Ny till $appname?";
"error_could_not_add_account" = "Could not store user information. Please try again.";
"account_not_new" = "En användare med samma namn och server finns redan i denna aparat";
"oauth2_error_access_denied" = "Nekad åtkomst av server";
"oauth2_error" = "Behörighet saknas";

//TabBarItems
"settings"="Inställningar";
"files_tab"="Filer";

//Uploading
"upload" = "Ladda upp";
"account" = "Konto:";
"location" = "Ort:";
"photo_albums" = "Fotoalbum";
"loading" = "Laddar ...";
"no_access_to_gallery" = "Vänligen aktivera åtkomst till foton och video för $appname. Detta alternativ kan hittas i Inställningar > Sekretess > Foton.";
"error" = "Fel";
"upload_failed"="Uppladdningen misslyckades";
"redirection_problem"="URL-omdirigeringsåtgärd stöds inte";
"all_photos" = "Alla foton";

//First View
"menu_upload" = "Ladda upp foto/video";
"menu_folder" = "Ny mapp";
"menu_text_file" = "Ny textfil";
"sort_menu_title" = "Sortera";
"sort_menu_by_name_option" = "A-Ö";
"sort_menu_by_modification_date_option" = "Nyaste-Äldsta";
"sort_menu_by_kind_option" = "Kind";

//Create/Edit File Text
"create_text_file" = "Skapa ny textfil";
"title_view_new_text_file" = "Ny textfil";
"title_view_edit_text_file" = "Ändra textfil";
"default_text_file_title" = "Ny textfil";
"title_text_file_placeholder" = "Titel...";
"body_text_file_placeholder" = "...";
"error_text_file_exist" = "finns redan";
"error_file_name_empty" = "Filnamnet får inte vara tomt";
"no_changes_made" = "Inga ändringar har gjorts";
"no_file_downloaded" = "Filen är inte nedladdad så du kan inte ändra den";


//Create Folder
"create_folder" = "Skapa ny mapp";
"folder_name" = "Ange mappnamn:";
"save" = "Spara";
"folder_exist" = "Mapp med angivet namn finns redan. Vänligen ange ett annat namn.";
"folder_create_error"="Mapp kunde inte skapas";
"not_show_potrait"="Meny är inte tillgänglig i liggande läge. Vänligen växla till stående läge.";
"not_possible_create_folder" = "Mapp kunde inte skapas.";

//FilesView
"confirm_to_delete_item" = "Bekräfta radering av post";
"yes" = "Ja";
"no" = "Nej";
"delete_from_device" = "Vill du verkligen ta bort denna fil från enheten?";
"delete_from_server" = "Vill du verkligen ta bort denna fil från servern?";
"not_possible_connect_to_server" = "Det är inte möjligt att ansluta till servern just nu.";
"delete_folder_from_server" = "Vill du verkligen ta bort denna mapp från servern?";
"delete_local_server" = "Ta bort från enhet och server";
"delete_local" = "Ta bort från enhet";
"delete_server" = "Ta bort från server";
"error_path" = "Not found. Please make sure it exists";
"error_not_permission" = "Du har inte behörighet att slutföra operationen";
"folders" = "mappar";
"files" = "fil";
"folder" = "mapp";
"file" = "fil";
"more_swipe" = "Mer";
"message_not_files" = "Ingenting här. Ladda upp något!";
"maintenance_mode_on_server_message" = "It is not possible to connect to the server at this time. The server is currently in maintenance mode";

//Refresh file list
"release_refresh"="Släpp för att uppdatera ...";
"loading_refresh"="Laddar...";
"pull_down_refresh"="Dra ned för att uppdatera.";

//Miscelanea
"back" = "Tillbaka";

//Preview
"open_with_label" = "Öppna med";
"delete_label"= "Ta bort";

//Open with
"file_cannot_be_opened" = "Fil kan inte öppnas";
"no_app_instaled_to_open_it" = "Det finns ingen installerat program för att öppna den här filtypen.";

//WTClient messages (Download/Upload)
"establishing_connection" = "Etablerar anslutning";
"not_establishing_connection" = "Kan inte etablera anslutning";
"connection_closed" = "Anslutning stängd";
"connection_lost" = "Anslutning förlorad";
"auth_failed" = "Autentisering misslyckades";
"auth_passed" = "Autentisering godkänd";
"request_file_not_found" = "Begärd fil hittades inte på servern";
"request_file_not_accesed" = "Begärd fil kan inte nås";
"unknow_response_server" = "Fel. Oväntat svar från server.";
"uploading_data" = "Laddar upp data";
"downloading_data" = "Laddar hem data";
"transfer_complete" = "Överföring fullständig";
"transfer_failed" = "Överföring misslyckad";
"download_file" = "Ladda ner fil";

//Settings and PinCode
"title_app_pin" = "Lösenkodslås";
"title_app_pin_and_touchID" = "Lösenkodslås och Touch-ID";
"title_app_pin_and_faceID" = "Passcode Lock & Face ID";
"title_app_pin_forced" = "Ändra lösenkod";
"enter_app_pin" = "Ange lösenkod";
"enter_app_pin_long_description_forced" = "Passcode required. You need to set a passcode to log in.";
"enter_app_pin_long_description" = "Ange lösenkod";
"reenter_app_pin" = "Ange lösenkod igen";
"remove_app_pin" = "Ta bort lösenkod";
"both_pass_not_same" = "The entered Passcodes are not the same";
"app_pin_incorrect" = "Felaktig lösenkod";
"passcode_not_enabled" = "Aktivera lösenkod först";
"title_app_touchID" = "Touch-ID";
"title_app_faceID" = "Face ID";
"disconnect_button" = "Koppla från den här servern";
"pin_removed" = "Lösenord borttaget";
"incorrect_pin" = "Felaktig lösenkod";
"app_pin_stored" = "Lösenord sparat";
"help" = "Hjälp";
"recommend_to_friend" = "Tipsa en vän";
"send_feedback" = "Skicka återkoppling";
"manage_accounts" = "Hantera konton";
"add_new_account" = "Lägg till nytt konto";
"save_changes" = "Spara";
"add_account" = "Lägg till";
"user_exist" = "Den angivna användaren finns redan";
"imprint_button" = "Impressum";
"title_instant_upload_photos"="Direktuppladdning av bilder";
"title_instant_upload_videos"="Direktuppladdning av videor";
"title_background_instant_upload" = "Direktuppladdning i bakgrunden";
"accounts_section" = "Konton";
"security_section" = "Säkerhet";
"instant_updloads_section" = "Direktuppladning";
"more_section" = "Mer";
"unlock_app" = "Lås upp $appname";
"passcode_forced_can_not_be_disabled" = "Passcode forced. Can not be disabled.";
"pending_migration_to_new_url" = "Enter to migrate to new URL";

//Downloading
"can_no_copy_to_gallery" = "Denna fil kan inte kopieras till galleriet, eftersom den inte kan öppnas av galleriet";
"file_is_downloading" = "Denna fil laddas redan hem";
"download_file_exist" = "Kan inte öppna denna fil. Säkerställ att den verkligen existerar";
"wait_to_download" = "Förbereder nedladdning";
"updating" = "Uppdaterar";
"msg_while_downloads" = "Denna operation är inte möjlig. Vänligen vänta tills aktuell nedladdningen är klar";
"streaming_no_possible_ssl_self_signed" = "Streaming cannot be initialized because your server certificate is untrusted. File download will start automatically";

//SSL
"invalid_ssl_cert" = "Webbplatsens identitet kunde inte verifieras. Väljer du att lita på certifikatet ändå?";
"connection_declined" = "Anslutning nekad av användare";
"server_certificate_untrusted" = "Litar inte på servercertifikat";

//Recent view
"recent_now"="Sekunder sedan";
"recent_minutes"="$minutes minuter sedan";
"recent_minute"="$minutes minut sedan";
"recent_hours"="$hours timmar sedan";
"recent_hour"="$hours timme sedan";
"recent_days"="$days dagar sedan";
"recent_day"="$days dag sedan";
"recent_months"="$months månader sedan";
"recent_month"="$months månad sedan";

"uploads_tab"="Uppladdningar";
"current_section"="Nuvarande";
"uploader_section"="Uppladdad";
"nothing_was_upload_recently"="Inget har nyligen laddats upp från denna enhet";
"failed_uploader_section"="Misslyckade uppladdningar";
"clear_successful"="Rensa lyckade";
"error_credential"="Fel Inloggningsuppgifter";
"error_destiny_does_not_exist"="Mappfel";
"error_file_exists"="Konfliktfel";
"error_permission" = "Behörighetsfel";
"error_not_allowed_by_firewall_rule" = "Filöverföring inte tillåten ";
"error_file_does_not_exist" = "Not available on the device";
"error_file_in_background" = "Serverfel";
"error_insufficient_storage" = "Inte tillräckligt med utrymme på ditt konto";
"error_file_invalid_characters" = "Felaktiga tecken";
"change_active_user"="Ändra den aktiva användaren till";
"waiting_for_server"="Väntar på serveranslutning";
"waiting_for_upload"="Väntar på att ladda upp";
"error_permission_alert_message" = "Du har inte rättighet att ladda upp till denna mapp";
"choose_folder" = "Välj mapp";

//Select Folder View
"upload_label"="Ladda upp till";
"create_button"="Skapa";
"choose_button"="Välj";

//Rename
"rename_long_press" = "Byt namn";
"rename_file_title" = "Byt namn";
"enter_new_name" = "Ange ett nytt namn:";
"rename_file_exist" = "Fil med angivet namn finns redan. Vänligen ange ett annat namn";

//Move
"move_long_press" = "Flytta";
"move_to_label" = "Flytta till";
"file_exist" = "Filen existerar redan i destinationsmappen";
"override_file" = "Vill du ersätta den befintliga filen med den här?";
"accept" = "Acceptera";
"error_folder_destiny_is_the_same" = "FEL: det är inte möjligt att flytta mappen till sig själv";
"original_file_exist" = "Det går inte att flytta filen. Säkerställ att filen verkligen existerar";
"original_folder_exist" = "Det går inte att flytta mappen. Säkerställ att den verkligen existerar";

//Download folfer
"download_folder" = "Nedladdningsmapp";
"cancel_download" = "Avbryt nedladdning";

//Upload from other apps
"other_apps_title" = "Mål";
"other_apps_account" = "Konto";
"other_apps_folder" = "Mapp";
"other_apps_file_name" = "Filnamn";
"other_apps_send_to" = "Ladda upp till";
"error_moving_file" = "Det går inte att flytta filen. Säkerställ att målmappen verkligen existerar";
"forbidden_characters_from_server" = "The name contains at least one invalid character";
"overwritte_title" = "Skriv över";

//Social
"twitter_message" = "Prova $twitteruser på din smarttelefon!";
"facebook_message" = "Prova $appname på din smarttelefon!\n";
"mail_recommendation_subject" = "Prova $appname på din smarttelefon!";
"mail_recommendation_body" = "Jag vill bjuda in dig till att använda $appname på din smarttelefon!\nLadda ner här: ";
"device_not_support_mail" = "Please, configure your mail account";
"mail_feedback_subject" = "Återkoppling $appname";
"account_not_configure" = "Din enhet har inte något konto konfigurerat. Gå till Inställningar för att konfigurera.";

//Storage
"of_storage" = "av";
"occupied_storage" = "upptagen";
"storage" = "Lagring";
"storage_upgrade" = "Uppgradera lagring";

//Jimmies
"this_file_is_older" = "Nyare version finns tillgänglig";
"msg_update_file_0_bytes" = "Filen på servern har 0 byte. Vill du skriva över den existerande filen på din enhet med denna innehållslösa fil?";

//Shared
"shared_tab" = "Publika länkar";
"message_not_shared_files" = "Det finns inga filer/mappar delade med länk än.";
"message_not_shared_api_support" = "Tyvärr är delning inte aktiverat på din server. Kontakta administratören";
"share_link_long_press" = "Dela";
"unshare_link" = "Sluta dela länk";
"share_not_available_on_this_server" = "Tyvärr är den här funktionen inte aktiverad på din server. Kontakta administratören";
"copy_link" = "Kopiera länk";
"file_to_share_not_exist" = "Det går inte att dela denna fil eller mapp. Säkerställ att den verkligen existerar";
"file_to_unshare_not_exist" = "Det går inte avsluta delning av denna fil eller mapp. Säkerställ att den verkligen existerar";
"shared_link_protected_title" = "Ange ett lösenord";
"shared_link_protected_message" = "För att dela en länk måste du sätta ett lösenord på den.";
"pasword_empty" = "Lösenord kan inte vara tomt";
"no_pasword" = "Du måste ange ett lösenord";
"get_share_link" = "Få publik länk";
"title_share_link_option_name" = "Länknamn";
"title_share_link_option_password" = "Lösenord";
"title_share_link_option_expiration" = "Upphör";
"title_share_link_option_allow_dowload_view" = "Ladda ner / Granska";
"title_share_link_option_allow_dowload_view_upload" = "Download / View / Upload";
"title_share_link_option_allow_upload_only" = "Upload only (File Drop)";
"placeholder_share_link_option_name" = "Namn";
"placeholder_share_link_option_password" = "Välj ett lösenord";
"placeholder_share_link_option_expiration" = "Utgångsdatum";
"title_view_create_link" = "Skapa en länkdelning";
"title_view_edit_link" = "Ändra länkdelning";
"title_confirm_delete_link" = "Ta bort länk";
"message_confirm_delete_link" = "! Ta bort $sharedLink";
"default_link_name" = "$fileName länk";
"allow_editing" = "Tillåt redigering";
"show_error_password_enforced" = "Lösenord krävs";
"show_error_expiration_enforced" = "The public link will expire no later than $nDays days after it is created";
"default_not_possible_msg" = "It is not possible to do this operation, try later please";
"share_user_group_indicator" = "Grupp";
"share_user_federated_indicator" = "fjärr";
"add_user_or_group_title" = "Lägg till Användare eller Grupp";
"share_with_users_or_groups" = "Användare och grupper";
"not_share_with_users_yet"= "Ej delad med några användare än";
"not_share_by_link_yet"= "Ej delad med publik länk än";
"not_sharee_api_supported" = "Sorry, your server version does not allow share with users. Please contact your administrator";
"share_link_title" = "Publika länkar";
"warning_sharing_public_link" = "Vem som helst med länken kan komma åt filen eller mappen";
"not_share_link_enabled_capabilities" = "Share Link is not enabled in this server. Please contact your administrator";
"shared_link_cannot_remove_password" = "Kan inte ba bort lösenordet";
"shared_link_cannot_remove_expiration_date" = "Cannot clear expiration date. Shares are required to have an expiration date";
"shared_link_mail_subject" = "$userName shared »$fileOrFolderName« with you";
"secured_link" = "Säkrad";
"message_private_link" = "Private link: Only people who have access to the file/folder can use it. Use it as a permanent link for yourself or to point others to files within shares";

//Shared privileges
"title_user_can_edit" = "Kan ändra";
"title_user_can_share" = "Kan dela";
"user_can_create" = "skapa";
"user_can_change" = "ändra";
"user_can_delete" = "radera";
"title_view_edit_user_privileges" = "Privilegier";

//Shared Link Options
"title_view_share_link_options" = "Länkalternativ";

//Favorites
"favorite" = "Favorit";
"unfavorite" = "Avfavoritisera";
"parent_folder_is_favorite" = "A folder that contains this file is already favorite";

//Available offline
"available_offline" = "Tillgänglig offline";
"not_available_offline" = "Ej tillgänglig offline";
"parent_folder_is_available_offline_file_child" = "A folder that contains this file is already available offline";
"parent_folder_is_available_offline_folder_child" = "A folder that contains this folder is already available offline";

//Document provider
"error_login_doc_provider" = "Unable to access your account. Please use the $appname app to sign in first.";
"error_sending_file_to_document_picker" = "Error sending file to document picker";
"error_user_change_in_core_app" = "Användaren har blivit ändrad i $appname appen";
"error_connecting_with_server" = "Det har inte varit möjligt att ansluta till servern, vänligen försök igen senare";
"move_doc_provider_button" = "Flytta till den här platsen";
"export_doc_provider_button" = "Exportera till den här platsen";

//Instant uploads
"location_not_enabled"="Platstjänster ej aktiverade";
"message_location_not_enabled"="Please go to Settings and turn on Location Services to enable instant photo uploads in the background.";

"access_photos_library_not_enabled" = "Åtkomst till Foton är inte aktverad";
"message_access_photos_not_enabled" = "Vänligen gå till Inställningar och aktivera åtkomst till Foton för att tillåta direktuppladdning utav bilder.";

//PDF reader
"page_of_pages" = "av"; //Example: 5 of 10

//Share in
"files_added" = "Filer tillagda";
"files_will_be_upload_next_time" = "The files will start to upload the next time that you open $appname";

//Help Guide main app
"title_help_slide_0" = "Välkommen till $appname!";
"message_help_slide_0" = "Dra för att läsa mer";
"title_help_slide_1" = "Direktuppladning";
"message_help_slide_1" = "Håll dina foton säkra";
"title_help_slide_2" = "Hantera alla dina filer";
"message_help_slide_2" = "Du kan ta bort och flytta";
"title_help_slide_3" = "Dela";
"message_help_slide_3" = "Du kan dela filer och mappar";
"title_help_slide_4" = "MultiKonto";
"message_help_slide_4" = "Anslut till alla dina moln";
"title_help_slide_5" = "Dina privata filer synkas var som helst";
"message_help_slide_5" = "5";
"sign_in_button_help_guide" = "Logga in";
"skip_button_help_guide" = "Hoppa över";

//Update Guide main app
"title_update_slide_0" = "Discover the new ownCloud App";
"message_update_slide_0" = "Rebuilt from scratch for iOS 11+";
"title_update_slide_1" = "PDF Viewer";
"message_update_slide_1" = "Easy Search and Navigation";
"title_update_slide_2" = "File Management";
"message_update_slide_2" = "Share Files and Folders";
"title_update_slide_3" = "Quick Access";
"message_update_slide_3" = "Complete Data Overview";
"title_update_slide_4" = "Multiple Accounts";
"message_update_slide_4" = "Access to all your clouds";
"title_update_slide_5" = "Get it for free on the AppStore";
"message_update_slide_5" = "Secure Data Management";
"sign_in_button_update_guide" = "Ladda ned";
"skip_button_update_guide" = "Ladda ned";

//Account menu
"menu_account_edit" = "Ändra lösenord";
"menu_account_clear_cache" = "Rensa cache";
"menu_account_log_out" = "Radera konto";

//Common
"not_connected_to_internet" = "Enheten är inte ansluten till ett nätverk";
"bad_request" = "Bad request";
"method_not_allowed" = "Method not allowed";
"proxy_auth_required" = "Proxy authorization required";
"conflict" = "Konflikt";
"internal_error" = "Internal server error";
"not_implemented" = "Inte införd";
"bad_gateway" = "Bad gateway";

//Private links
"private_link_redirection_failed" = "The item does not exist";
"error_connecting_with_server" = "Det har inte varit möjligt att ansluta till servern, vänligen försök igen senare";
"private_link_not_reachable" = " Private link could not be opened";
